{
"ind":{"Offset_Beams":0,"Angle_Beams":1, "90_Beams":2, "Connectors":3, "1x_Beams":4, "2x_Beams":5, "3x4_TeeBeam":6, "Standoffs":7, "Plates":8, "Dist_Sensor":9, "Robot_Brain":10, "Smart_Motor":11, "Touch_LED":12 },
"classes":["Offset beams","Angle beams", "90 degree beams", "Connectors", "1 by beams", "2 by beams", "3 by 4 Tee beam", "Standoffs", "Plates", "Distance Sensor", "Robot Brain", "Smart Motor", "Touch LED"],
"descriptions":["Offset beams let you connect parts at different heights, so you can build things that stand out and fit together just right in VEXIQ projects. They're like puzzle pieces that make your creations more creative and sturdy.",
  "Angle beams help you make strong corners or slanted parts in your VEXIQ projects, so your builds can be more interesting and hold together better. They're like the glue that keeps your creations solid and cool-looking.", 
  "With 90-degree beams, you can make perfect corners, just like the corners of a room, in your VEXIQ builds. They're like the building blocks that give your creations a strong foundation and keep everything in place.",
  "These connectors are like the secret sauce for your VEXIQ creations, helping you make strong corners and angles so your builds stay sturdy and look awesome. They're the key to unlocking your imagination and building something amazing.",
  "1x beams are the basic building blocks for your VEXIQ creations, perfect for simple connections that make your builds come to life. They're like the building blocks you start with, laying the foundation for all your awesome ideas.",
  "Stronger and wider than 1x beams, 2x beams are like the big brothers of your VEXIQ creations, giving them extra strength and stability. They're like the superheroes that swoop in to save the day when your builds need a little extra support.",
  "Teebeams are like the Swiss Army knives of your VEXIQ toolbox, letting you connect pieces in different directions to build all sorts of cool stuff.",
  "Standoffs are like mini pillars that lift and support parts in your VEXIQ builds, giving them extra space and stability. They're like the tiny superheroes that keep everything standing tall and strong.",
  "Plates are like the sturdy platforms that hold your VEXIQ creations together, providing a solid base for building and connecting different parts. They're like the foundation of a house, giving your builds a sturdy structure to stand on and grow from.",
  "A distance sensor helps your robot see how far away things are, so it can avoid obstacles and move around safely in your VEXIQ projects. It's like giving your robot eyes to navigate through its world and make smart decisions",
  "The robot brain is like the control center of your VEXIQ creation, where all the decisions are made. It's where your robot's programming lives, telling it what to do and how to do it. Think of it as the brain that powers your robot and makes it come to life.",
  " Smart motors are like the muscles of your VEXIQ robot, providing the power and movement needed to perform tasks. They're special because they can communicate with the robot brain, allowing for precise control and coordination. They're like the strong arms and legs that help your robot accomplish its missions.",
  "The touch LED is a cool tool that lets your robot sense when it's being touched and even light up to show different signals or messages. It's like a secret communicator between your robot and the outside world, adding an extra layer of interactivity and fun to your VEXIQ projects.",
]
}
